src/cf/Documents/РасчетыЧерезКассу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>РасчетыЧерезКассу</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиПродуктов</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.СтоимостьПродуктов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Comment>Место производства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Покупка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборСвойств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выручка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/ОстаткиПродуктов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиПродуктов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/СтоимостьПродуктов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>СтоимостьПродуктов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Продукт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/РасчетыЧерезКассу/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Продажи.Записывать = Истина;	
	Движения.ОстаткиПродуктов.Записывать = Истина;
	Движения.СтоимостьПродуктов.Записывать = Истина;  
	
	//Создать менеджер временных таблиц. 
	МенеджерВТ = Новый МенеджерВременныхТаблиц; 
	Запрос = Новый Запрос; 
	
	//Укажем, какой менеджер временных таблиц использует этот запрос 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ; 	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасчетыЧерезКассуПокупка.Номенклатура,
	|	РасчетыЧерезКассуПокупка.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	СУММА(РасчетыЧерезКассуПокупка.Количество) КАК КоличествоВДокументе,
	|	МАКСИМУМ(РасчетыЧерезКассуПокупка.Сумма) КАК СуммаВДокументе
	|ПОМЕСТИТЬ НоменклатураДокумента
	|ИЗ
	|	Документ.РасчетыЧерезКассу.Покупка КАК РасчетыЧерезКассуПокупка
	|ГДЕ
	|	РасчетыЧерезКассуПокупка.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыЧерезКассуПокупка.Номенклатура,
	|	РасчетыЧерезКассуПокупка.Номенклатура.ВидНоменклатуры";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Запрос2 = Новый Запрос; 
	Запрос2.МенеджерВременныхТаблиц = МенеджерВТ; 
	Запрос2.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураДокумента.Номенклатура,
	|	НоменклатураДокумента.ВидНоменклатуры,
	|	НоменклатураДокумента.КоличествоВДокументе,
	|	НоменклатураДокумента.СуммаВДокументе,
	|	ЕСТЬNULL(СтоимостьПродуктовОстатки.СтоимостьОстаток, 0) КАК Стоимость,
	|	ЕСТЬNULL(ОстаткиПродуктовОстатки.КоличествоОстаток, 0) КАК Количество
	|ИЗ
	|	НоменклатураДокумента КАК НоменклатураДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьПродуктов.Остатки(
	|				,
	|				Продукт В
	|					(ВЫБРАТЬ
	|						НоменклатураДокумента.Номенклатура
	|					ИЗ
	|						НоменклатураДокумента)) КАК СтоимостьПродуктовОстатки
	|		ПО НоменклатураДокумента.Номенклатура = СтоимостьПродуктовОстатки.Продукт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиПродуктов.Остатки(
	|				,
	|				Продукт В
	|					(ВЫБРАТЬ
	|						НоменклатураДокумента.Номенклатура
	|					ИЗ
	|						НоменклатураДокумента)) КАК ОстаткиПродуктовОстатки
	|		ПО НоменклатураДокумента.Номенклатура = ОстаткиПродуктовОстатки.Продукт";
	
	
	//Установим необходимость блокировки данных в регистрах СтоимостьМатериалов и ОстаткиМатериа-лов. 
	Движения.СтоимостьПродуктов.БлокироватьДляИзменения = Истина; 
	Движения.ОстаткиПродуктов.БлокироватьДляИзменения = Истина; 


	//Запишем пустые наборы записей, чтобы читать остатки без учета данных в документе. 
	Движения.СтоимостьПродуктов.Записать(); 
	Движения.ОстаткиПродуктов.Записать(); 
	
	Результат = Запрос2.Выполнить(); 
		
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Количество = 0 Тогда 
			СтоимостьПродукта = 0; 
		Иначе 
			СтоимостьПродукта = ВыборкаДетальныеЗаписи.Стоимость/ВыборкаДетальныеЗаписи.Количество; 
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Продукт Тогда
			
			// регистр ОстаткиПродуктов Расход
			Движение = Движения.ОстаткиПродуктов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Продукт = ВыборкаДетальныеЗаписи.Номенклатура;
			Движение.ТорговаяТочка = ТорговаяТочка;
			Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоВДокументе;    
			
			// регистр СтоимостьПродуктов Расход
			Движение = Движения.СтоимостьПродуктов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Продукт = ВыборкаДетальныеЗаписи.Номенклатура;
			Движение.Стоимость = ВыборкаДетальныеЗаписи.КоличествоВДокументе*СтоимостьПродукта;
			
		КонецЕсли;
		
		// регистр Продажи 
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.Клиент = Клиент;
		Движение.ТорговаяТочка = ТорговаяТочка;
		Движение.Продавец = Продавец;
		Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоВДокументе;
		Движение.Выручка = ВыборкаДетальныеЗаписи.СуммаВДокументе;
		Движение.Стоимость = СтоимостьПродукта * ВыборкаДетальныеЗаписи.КоличествоВДокументе;  
		
	КонецЦикла;
	
	Если Режим = РежимПроведенияДокумента.Оперативный Тогда 
		//проверить отрицательные остатки. 
		Запрос3 = Новый Запрос; 
		Запрос3.МенеджерВременныхТаблиц = МенеджерВТ; 
		
		Запрос3.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиПродуктовОстатки.Продукт,
		|	ОстаткиПродуктовОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиПродуктов.Остатки(
		|			,
		|			Продукт В
		|					(ВЫБРАТЬ
		|						НоменклатураДокумента.Номенклатура
		|					ИЗ
		|						НоменклатураДокумента)
		|				И ТорговаяТочка = &ТорговаяТочка) КАК ОстаткиПродуктовОстатки
		|ГДЕ
		|	ОстаткиПродуктовОстатки.КоличествоОстаток < 0";    
		
		Запрос3.УстановитьПараметр("ТорговаяТочка", ТорговаяТочка); 
		
		Результат = Запрос3.Выполнить(); 
		ВыборкаДетальныеЗаписи = Результат.Выбрать(); 
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			Сообщение = Новый СообщениеПользователю(); 
			Сообщение.Текст = "Не хватает" + Строка(- ВыборкаДетальныеЗаписи.КоличествоОстаток) + "единиц продукта""" + ВыборкаДетальныеЗаписи.Продукт + """"; 
			Сообщение.Сообщить(); 
			Отказ = Истина; 
		КонецЦикла; 
		
	КонецЕсли;
	
КонецПроцедуры
